# Дана последовательность целых чисел. Поменять местами ее первую и
# последнюю трети.

num = [ 1, 2, 3, 4, 5, 6]
#tret = [num in num//3 for num]

#print(list(filter(lambda x: x % 2 == [1, 3, 2, 5, 20, 21])))



from functools import reduce
print(reduce(lambda x,y: y-x))