# Дана последовательность целых чисел. Поменять местами ее первую и
# последнюю трети.
#from functools import reduce


#num = [1,2,3,4,5,6]
#tret = [num in num//3 for num]

print(list(filter(lambda x: x % 2 == [1, 2, 4, 5, 6])))




#print(reduce(lambda x,y: y-x))