#Даны строки S, S1 и S2. Заменить в строке S последнее вхождение строки S1 на строку
#S2.
from re import search

s = 'im да'
s1 = 'no'
s2 = 'yes'


#search = rfind()
zamena = s.replace(s,s1)

print(s)











#b = s1[::-1]
#a = s1.find('тен')
#rfind(
#replace(s)
#добавить к s да и заменить на нет
#добвить ад и реплейс первый индекс