#Даны множества A и B, состоящие соответственно из N1 и N2 точек (точки заданы
#своими координатами x, у). Найти минимальное расстояние между точками этих
#множеств и сами точки, расположенные на этом расстоянии (вначале выводится
#точка из множества A, затем точка из множества B).
#Расстояние R между точками с координатами (x1, y1) и (x2, у2) вычисляется по формуле:
#R = √(x2 – x1)2 + (у2 – y1)2
#Для хранения данных о каждом наборе точек следует использовать по два списка: первый
#список для хранения абсцисс, второй — для хранения ординат.
